Repository: icann/lgr-django
Catalog: src/lgr_advanced/lgr_editor/locale/*/LC_MESSAGES/django.po
Languages: fr

source: space-separated tags
fr: liste de tags séparés par des espaces

source: Override repertoire
fr: Ignorer le répertoire

source: Disabled code points
fr: Code points indisponibles

source: First code point
fr: Premier code point

source: Last code point
fr: Dernier code point

source: Last code point (%(last_cp)s) must not be smaller than the first code point (%(first_cp)s)
fr: Le dernier code point (%(last_cp)s) ne peut être plus petit que le premier code point (%(first_cp)s)

source: Validating repertoire
fr: Répertoire de validation

source: Manual import
fr: Importation manuelle

source: Select a file
fr: Sélectionner un fichier

source: Cannot add when and not-when rules simultaneously
fr: Impossible d'ajouter when et not-when simultanément

source: Please provide at least one value
fr: Fournissez au moins une valeur s'il vous plait

source: File must be encoded in UTF-8 and using 0x0A line ending.
fr: Le fichier doit être encodé en UTF-8 et utiliser les retours à la ligne 0x0A.

source: File should be a text file encoded in UTF-8 and using 0x0A line ending. It must contain one label per line in U-Label or A-Label form or as a list of code points. Comments begin with '#'
fr: Le fichier doit être au format texte, encodé en UTF-8 et utiliser les retours à la ligne 0x0A. Il doit contenir un label par ligne, au format U-Label ou A-Label ou sous la forme d'une liste de code points. Les commentaires commencent par '#'

source: Label can be in U-Label or A-Label form or a list of code points.
fr: Le label peut être au format U-Label ou A-Label ou sous la forme d'une liste de code points.

source: Code points will be limited to the selected repertoire
fr: Les code points seront limités au répertoire sélectionné

source: Name
fr: Nom

source: Select file(s)
fr: Sélectionner un/des fichier(s)

source: LGR set name
fr: Nom du set LGR

source: Enter a valid LGR set name. This value may contain only letters, numbers and ./-/_ characters.
fr: Entrer un nom de LGR valide. Cette valeur ne peut que contenir des lettres, nombres et les caractères ./-/_.

source: The name of the set
fr: Nom du set

source: Version comment
fr: Commentaire de version

source: Scope
fr: Portée

source: Scope type
fr: Type de la portée

source: Validity start
fr: Début de la validité

source: Validity end
fr: Fin de la validité

source: Description type
fr: Type de la description

source: Unicode version
fr: Version d'Unicode

source: Built-in
fr: Fournis

source: My LGRs
fr: Mes LGRs

source: Language
fr: Langage

source: Invalid format
fr: Format invalide

source: References
fr: Références

source: Meta data
fr: Métadonnées

source: Rules
fr: Règles

source: Embedded LGRs
fr: LGR embarquées

source: Cancel
fr: Annuler

source: Save
fr: Sauvegarder

source: Edit
fr: Modifier

source: Next
fr: Suivant

source: Code points added. <a href="%(url)s" href="_top">Click here</a> if you are not redirected automatically.
fr: Code point ajouté. <a href="%(url)s" href="_top">Cliquez ici</a> si vous n'êtes pas redirigé automatiquement.

source: Populate variants
fr: Peupler les variantes

source: Expand range(s)
fr: Convertir tous les ensembles

source: Add code point(s)
fr: Ajouter un/des code point(s)

source: Character Name
fr: Nom du caractère

source: Comments
fr: Commentaires

source: Add Rule
fr: Ajouter une règle

source: There is no rule in the current LGR
fr: Il n'y a pas de règles dans la LGR courante

source: Close
fr: Fermer

source: <p>This rule will be added to <b><span class="nbr-selected"></span> codepoint(s)</b></p>
fr: <p>Cette règle va être ajoutée à <b><span class="nbr-selected"></span> code point(s)</b></p>

source: Add Tags
fr: Ajouter des Tags

source: <p>These tags will be added to <b><span class="nbr-selected"></span> codepoint(s)</b></p>
fr: <p>Ces tags vont être ajoutées à <b><span class="nbr-selected"></span> code point(s)</b></p>

source: Code point range
fr: Ensemble de Code points

source: Code point from script
fr: Code point depuis un script

source: Import from file
fr: Importer depuis un fichier

source: Add Code Point
fr: Ajouter un Code Point

source: Variant(s)
fr: Variante(s)

source: See code point
fr: Voir le code point

source: Expand range
fr: Convertir l'ensemble

source: ➡ Select code point(s) to apply batch action...
fr: ➡ Sélectionner les code points sur lesquels appliquer une action par lots...

source: Add WLE
fr: Ajouter une WLE

source: ➡ Apply batch action...
fr: ➡ Appliquer action par lots...

source: Code point appeared in Unicode version: %(age)s
fr: Le code point est apparu dans Unicode version : %(age)s

source: Add variant
fr: Ajouter une variante

source: Code point is not in LGR
fr: Le code point n'est pas dans la LGR

source: Are you sure you want to delete this variant?
fr: Êtes-vous sûr.e de vouloir supprimer cette variante ?

source: Delete variant
fr: Supprimer la variante

source: Edit references
fr: Modifier les références

source: Range characters do not have variants.
fr: Les ensembles de caractères n'ont pas de variantes.

source: Code point has not variant
fr: Le code point n'a pas de variante

source: Save variants, tags, context rules and comment
fr: Sauvegarder les variantes, tags, règles contextuelles et commentaires

source: No references associated with code point.
fr: Aucune référence associée au code point.

source: Are you sure you want to delete this code point?
fr: Êtes-vous sûr(e) de vouloir supprimer ce code point ?

source: Delete code point
fr: Supprimer le code point

source: Edit References for <span></span>
fr: Modifier les références pour <span></span>

# button title
source: Delete reference
fr: Supprimer la référence

source: Add an existing reference
fr: Ajouter un référence existante

source: Add
fr: Ajouter

source: Create a new reference
fr: Créer une nouvelle référence

source: Error when adding reference
fr: Erreur lors de l'ajout d'une référence

source: Reference ID (optional)
fr: Id de référence (optionnel)

source: URL (optional)
fr: URL (optionnelle)

source: New reference
fr: Nouvelle référence

source: Save changes
fr: Sauvegarder les changements

source: List of LGRs in the set
fr: Liste des LGR dans le set

source: Import existing LGR
fr: Importer une LGR existante

source: To import LGR set, select the files composing the LGR set. The set will automatically be created.
fr: Pour importer un set LGR, sélectionner les fichiers composants le set LGR. Le set sera créé automatiquement.

source: <strong> <i class="glyphicon glyphicon-info-sign"></i> Import function will only perfom some basic checking (example: XML validity). Once the LGR has been imported, you need to use the <emph>Validate LGR</emph> button to do a complete check. </strong>
fr: <strong> <i class="glyphicon glyphicon-info-sign"></i> La fonction d'importation effectue uniquement quelques tests de base (par exemple, la validité du XML). Une fois la LGR importée, vous devez utiliser le bouton <emph>Valider la LGR</emph> pour effectuer un test complet. </strong>

source: These LGRs are already imported. Click on one to access it.
fr: Les LGRs suivantes sont déjà importées. Cliquer pour y accéder.

source: Import
fr: Importer

source: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> Note that importing large LGR files may take significant time to load on your browser.</strong>
fr: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> L’importation de gros fichiers LGR peut être lente à charger dans le navigateur.</strong>

source: Cannot import LGR file(s):
fr: Impossible d'importer le(s) fichier(s) LGR :

source: There was an error saving; please see error(s) below
fr: Il y a eu une erreur lors de la sauvegarde, merci de regarder ci-dessous

source: Create a new LGR
fr: Créer une nouvelle LGR

source: These LGRs are already created. Click on one to access it.
fr: Les LGRs suivantes sont déjà créées. Cliquez pour y accéder.

source: Create
fr: Créer

source: Existing references
fr: Références existantes

source: Reference id
fr: Identifiant de référence

source: Are you sure you want to delete this reference?
fr: Êtes-vous sûr(e) de vouloir supprimer cette référence ?

source: The LGR has no class
fr: La LGR n'a pas de classes

source: The LGR has no rule
fr: La LGR n'a pas de règles

source: The LGR has no action
fr: La LGR n'a pas d'actions

source: New class
fr: Nouvelle classe

source: New rule
fr: Nouvelle règle

source: New action
fr: Nouvelle action

source: Existing tags
fr: Tags existants

source: Tag name
fr: Nom du tag

source: Associated code points
fr: Code points associés

source: View all (%(nb_cp)s)
fr: Voir tout (%(nb_cp)s)

source: Are you sure you want to delete tag %(tag)s?
fr: Êtes-vous sûr(e) de vouloir supprimer le tag %(tag)s ?

source: <span style="font-weight: bold">To create a new tag:</span> Add it to a code point first to find it back in this list
fr: <span style="font-weight: bold">Pour créer un nouveau tag:</span> Ajouter le tag à un code point afin de le retrouver dans cette liste

source: Erroneous conditional code points
fr: Erreur dans les code points conditionels

source: Code point %(cp)s has invalid %(rule_type)s rule %(rule)s for variant %(variant)s
fr: Le code point %(cp)s a la règle %(rule_type)s %(rule)s invalide pour les variantes %(variant)s

source: Conditional variants OK
fr: Variantes conditionnelles OK

source: Missing code points or rules
fr: Code points ou règles manquants

source: Variant %(variant)s is not in repertoire
fr: La variante %(variant)s n'est pas dans le répertoire

source: %(variant)s has not original code point in its variants
fr: %(variant)s n'a pas le code point original dans ses variantes

source: %(variant)s has not symmetric %(rule_type)s rule %(rule)s on its symmetric variants
fr: %(variant)s n'a pas la règle %(rule_type)s %(rule)s dans ses variantes symmétriques

source: %(variant)s unknown symmetry problem, please report
fr: %(variant)s problème de symétrie inconnu, veuillez contacter le support

source: Symmetry OK
fr: Symétrie OK

source: Missing variants
fr: Variantes manquantes

source: Code point %(cp)s is missing variant %(variant)s
fr: Le code point %(cp)s n'a pas la variante %(variant)s

source: Transitivity OK
fr: Transitivité OK

source: XML is valid and complies with RNG.
fr: XML valide et conforme au RNG.

source: Invalid XML for lgr: %(res)s
fr: Fichier XML invalide pour la LGR: %(res)s

source: General stats
fr: Statistiques générales

source: Number of code points: %(nbr)s
fr: Nombre de code points: %(nbr)s

source: Number of ranges: %(nbr)s
fr: Nombre d'intervalles: %(nbr)s

source: Largest range: %(largest)s (length: %(largest_len)s)
fr: Plus grand intervalle: %(largest)s (longueur: %(largest_len)s)

source: Number of sequences: %(nbr)s
fr: Nombre de séquences: %(nbr)s

source: Largest sequence: %(largest)s (length: %(largest_len)s)
fr: Plus grande séquence: %(largest)s (longueur: %(largest_len)s)

source: Variants
fr: Variante(s)

source: Total number of variant mappings: %(nbr)s
fr: Nombre total de variantes mappées: %(nbr)s

source: Average number of variants per code point: %(nbr)s
fr: Nombre moyen de variantes par code point: %(nbr)s

source: Largest variant set: %(largest_set)s
fr: Plus grand ensemble de variantes: %(largest_set)s

source: Variants per type:
fr: Variantes par type:

source: Number of variants for type %(variant_type)s: %(number)s
fr: Nombre de variantes pour le type %(variant_type)s: %(number)s

source: Number of code points for tag %(tag_name)s: %(number)s
fr: Nombre de code points pour le tag %(tag_name)s: %(number)s

source: Number of defined rules: %(nbr)s
fr: Nombre de règles définies: %(nbr)s

source: Unicode version %(version)s
fr: Version d'Unicode %(version)s

source: Validating repertoire '%(repertoire)s'
fr: Répertoire de validation '%(repertoire)s'

source: Target Unicode version %(version)s differs from UnicodeDatabase %(database)s
fr: La version Unicode cible %(version)s diffère de UnicodeDatabase %(database)s

source: Possibly erroneous characters
fr: Caractères possiblement erronés

source: Character %(cp)s:
fr: Caractère %(cp)s:

source: Warning: %(warn)s
fr: Attention : %(warn)s

source: Error: %(err)s
fr: Erreur: %(err)s

source: Variant: %(variant|render_char)s
fr: Variante: %(variant|render_char)s

source: LGR rebuild OK
fr: Reconstruction de la LGR OK

source: Automatically added codepoint %s from out-of-repertoire-var variant
fr: Code point %s automatiquement ajouté depuis une variante hors-répertoire

source: New variant %s added
fr: Nouvelle variante %s ajoutée

source: Code point edited
fr: Code point modifié

source: References updated successfully
fr: Les références ont été correctement mises à jour

source: Variant %(var_codepoint)s for code point %(codepoint)s with when=%(when)s and not-when=%(not_when)s could not be found
fr: La variante %(var_codepoint)s du code point %(codepoint)s avec when=%(when)s et not-when=%(not_when)s n'a pas été trouvée

source: Code point %s has been deleted
fr: Le code point %s a été supprimé

source: Variant %(var_cp)s with when='%(when)s' and not-when='%(not_when)s'
fr: La variante %(var_cp)s avec when='%(when)s' and not-when='%(not_when)s'

source: %(var_msg_prefix)s has been deleted
fr: %(var_msg_prefix)s a été supprimée

source: %(var_msg_prefix)s could not be deleted because it was not found
fr: %(var_msg_prefix)s n'a pas pu être supprimée car elle n'a pas été trouvée

source: %d code points added
fr: %d code points ont été ajoutés

source: No code point in input file
fr: Le fichier d'entrée ne contient aucun code point

source: New code point %s added
fr: Nouveau code point ajouté %s

source: Rule
fr: Règle

source: rule
fr: règle

source: %(operation)s successfully added to %(nb_cp)s code point(s)
fr: %(operation)s ajouté(s) avec succès à %(nb_cp)s code point(s)

source: %(nb_cp)s code points were not updated to avoid invalid %(operation)s
fr: %(nb_cp)s code points n'ont pas été mis à jour pour éviter des %(operation)s invalides

source: Variants populated
fr: Les variantes ont été peuplées

source: The LGR you have tried to create already exists in your working session. Please use a new name.
fr: La LGR que vous essayez de créer existe déjà dans votre session de travail. Merci d'utiliser un nouveau nom.

source: The LGR set name already exists. Please use another name.
fr: Ce nom de set LGR existe déjà. Merci d'utiliser un autre nom.

source: The LGR you have tried to import already exists in your working session. Please rename it before importing it.
fr: La LGR que vous essayez d'importer existe déjà dans votre session de travail. Merci de renommer le fichier avant de l'importer.

source: The LGR you have tried to import already exists in your set. Please rename it before importing it.
fr: La LGR que vous essayez d'importer existe déjà dans votre ensemble. Merci de renommer le fichier avant de l'importer.

source: Meta data saved
fr: Metadonnées sauvegardées

source: Cannot edit LGR set
fr: Impossible d'éditer le set LGR

source: New reference created
fr: Nouvelle référence créée

source: Encountered XML syntax error: %s (line number may be wrong, try subtracting one from the reported line number)
fr: Erreur de syntaxe XML : %s (le numéro de ligne peut-être incorrect, essayer de soustraire un au numéro reporté)

source: Your XML is not valid
fr: Votre XML n'est pas valide

source: No body specified
fr: Aucun contenu spécifié

source: Class "%s" does not exist
fr: La classe "%s" n'existe pas

source: Class "%s" deleted.
fr: Classe "%s" supprimée.

source: No class element found
fr: Aucune classe trouvée

source: Name attribute must be present
fr: L'attribut name est obligatoire

source: Class "%s" already exists
fr: La classe "%s" existe déjà

source: Class "%s" saved.
fr: Classe "%s" sauvegardée.

source: Rule "%s" does not exist
fr: La règle "%s" n'existe pas

source: Rule "%s" deleted.
fr: Règle "%s" supprimée.

source: No rule element found
fr: Aucune règle trouvée

source: Rule "%s" already exists
fr: La règle "%s" existe déjà

source: Rule "%s" saved.
fr: Règle "%s" sauvegardée.

source: Action "%s" does not exist
fr: Action "%s" n'existe pas

source: Action "%s" deleted.
fr: Action "%s" supprimée.

source: No action element found
fr: Aucune action trouvée

source: Action saved.
fr: Action sauvée.

source: LGR is not a set
fr: La LGR n'est pas un set LGR

source: References to tag %(tag)s have been removed from the repertoire. Do not forget to update any WLE that might reference it.
fr: Les références au %(tag)s ont été supprimées du répertoire. N'oubliez pas de mettre à jour les WLE qui pourraient les utiliser.

source: Testing XML validity using RNG
fr: Validation du XML par le RNG

source: Testing symmetry
fr: Test de la symmétrie

source: Testing transitivity
fr: Test de la transitivité

source: Testing conditional variants
fr: Test des variantes conditionnelles

source: Generate stats
fr: Génération des statistiques

source: Rebuilding LGR
fr: Reconstruction de la LGR
