Repository: icann/lgr-django
Catalog: src/lgr_idn_table_review/idn_tool/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Select IDN table(s) to review
fr: Sélectionner la(les) table(s) IDN à vérifier

source: You can select up to %(max_files)s IDN tables.
fr: Vous pouvez téléverser jusqu'à %(max_files)s tables IDN.

source: You can upload up to %(max_files)s files
fr: Vous pouvez téléverser jusqu'à %(max_files)s fichiers

source: Required
fr: Requis

source: IDN Table Review reports
fr: Rapports de vérification des Tables IDN

source: IDN Table Review Reports
fr: Rapports de vérification des Tables IDN

source: The following folders contains your IDN review reports.
fr: Le dossier suivant contient les rapport de vérification des Tables IDN.

source: Are you sure you want to delete report %(report_id)s?
fr: Êtes vous sur de vouloir supprimer le rapport %(report_id)s ?

source: No report yet, please check the <a href="%(task_status_url)s">tasks</a> and refresh.
fr: Aucun rapport pour l'instant, vérifiez la liste de <a href="%(task_status_url)s">tâches</a> et rafraîchissez s'il vous plaît.

source: New report
fr: Nouveau rapport

source: IDN Table Review
fr: Vérification de Table IDN

source: Next...
fr: Suivant...

source: See previous reports
fr: Voir les rapport précédents

source: IDN table
fr: Table IDN

source: LGR to review against
fr: LGR avec laquelle effectuer la vérification

source: Select existing LGR
fr: Sélectionnez une LGR existante

source: Review against xml
fr: Vérifier avec un fichier xml

source: Review
fr: Vérifier

source: %(filename)s is an invalid IDN table
fr: %(filename)s est une table IDN invalide

source: Review of %(count)d IDN table
fr: Revue de %(count)d table IDN

source: IDN Table Review Reports: %(report)s
fr: Rapport de Vérification de Table IDN: %(report)s
