Repository: icann/lgr-django
Catalog: src/lgr_validator/locale/*/LC_MESSAGES/django.po
Languages: fr

source: the LGR set labels
fr: la liste de labels du set LGR

source: the TLDs list
fr: la liste de TLDs

source: The label is in %(labels_list)s
fr: Le label est dans %(labels_list)s

source: ERROR more than one collision, please check %(labels_list)s
fr: ERREUR plus d'une collision, vérifier %(labels_list)s svp

source: ERROR cannot retrieve label in collisions, please check %(labels_list)s
fr: ERREUR impossible de retrouver le label dans les collisions, vérifier %(labels_list)s

source: ERROR collision with more than one label in %(labels_list)s, please check it
fr: ERREUR collision avec plus d'un label dans %(labels_list)s, vérifiez la svp

source: Maximum length: 63 code points
fr: Longueur maximale : 63 code points

source: Provide your e-mail address
fr: Fournir votre adresse e-mail

source: Allocated Set labels
fr: Labels du set alloués

source: Optional list of labels already allocated in the LGR set, that will be used to check for collisions when evaluating labels using the merged LGR set
fr: Liste optionnelle des labels déjà alloués dans le set LGR, qui sera utilisée pour vérifier les collisions lors de l'évaluation des labels utilisant le set LGR mergé

source: The script used to validate the label
fr: Le script utilisé pour valider le label

source: Code point sequence
fr: Séquence de code points

source: Show / hide log
fr: Montrer / Cacher les logs

source: <b>[Action index: %(action_idx)s]</b> %(action)s
fr: <b>[Index de l'action : %(action_idx)s]</b> %(action)s

source: Collision(s) found
fr: Collision(s) trouvée(s)

source: No collision
fr: Pas de collisions

source: No collision.
fr: Pas de collisions.

source: Variant labels
fr: Labels variants

source: (including original as last)
fr: (incluant l'original en dernier)

source: %(num_variants)s variant label(s) generated.
fr: %(num_variants)s label(s) variant(s) généré(s).

source: By disposition:
fr: Par disposition :

source: No variant labels generated.
fr: Aucun label variant généré.

source: Too many variant labels to be displayed in the browser. Please download the results in .csv instead.
fr: Trop de labels variants pour être affichés dans le navigateur. Prière de télécharger le resultat au format CSV.

source: Download results in CSV
fr: Télécharger les résultats en CSV

source: Validate
fr: Valider

source: As the computing may be very long, once completed, an e-mail will be sent at the provided address
fr: Comme le traitement peut être long, une fois complété, un e-mail vous sera envoyé à l'adresse fournie

source: Input label generates too many variants to compute them all quickly. You need to enter your email address and will receive a notification once process is done
fr: Le label entré peut générer trop de variantes pour rapidement toutes les calculer. Vous devez rentrer votre adresse e-mail et recevrez une notification une fois que le processus est terminé
