Repository: icann/lgr-django
Catalog: src/lgr_manage/locale/*/LC_MESSAGES/django.po
Languages: fr

source: LGR file(s)
fr: Fichier(s) LGR

source: Common LGR file
fr: Fichier pour la LGR commune

source: Name
fr: Nom

source: Reference LGR member file
fr: Fichier pour la LGR de référence

source: Language/script tag
fr: Tag de langage/script

source: Unable to retrieve file with this name
fr: Impossible de retrouver un fichier avec ce nom

source: This reference LGR member already exists
fr: Ce membre de la LGR de référence existe déjà

source: Common Reference LGR member files
fr: Fichier pour la LGR de référence commune

source: Common Reference LGR file
fr: Fichier pour la LGR de référence commune

source: IDNA Repertoire
fr: Répertoire IDNA

source: Variant Calculation Limit
fr: Limite de calcul des variants

source: Variant Calculation Max
fr: Limite maximale de calcul des variants

source: Variant Calculation Skip
fr: Abandon du calcul des variants

source: Report expiration delay
fr: Délai d'expiration des raports

source: Above this limit, only allocatable labels will be displayed and result can be downloaded
fr: Au delà de cette limite, uniquement les labels de disposition allocatable seront affichés et le résultat pourra être téléchargé

source: Above this limit, results would be computed in a background task
fr: Au delà de cette limite, les résultats seront calculés dans une tâche en arrière plan

source: Above this limit, no results would be computed
fr: Au delà de cette limite, aucun résultat ne sera calculé

source: The delay after which a report is automatically deleted, in days
fr: Le délai après lequel un rapport est automatiquement supprimé, en jours

source: LGR tool admin
fr: Administration de l'outil LGR

source: Root Zone LGRs
fr: LGRs pour la Root Zone

source: Reference LGRs
fr: LGRs de référence

source: IDNA Repertoires
fr: Répertoire IDNA

source: User management
fr: Gestion des utilisateurs

source: Tool Setting
fr: Paramètrage de l'outil

source: Update Reference LGR member
fr: Mise à jour du membre de la LGR de référence

source: Existing IDNA Repertoires
fr: Répertoires IDNA existants

source: Active
fr: Actif

source: Are you sure you want to delete LGR %(idna)s?
fr: Êtes vous sur de vouloir supprimer la LGR %(idna)s ?

source: No IDNA Repertoire.
fr: Aucun répertoire IDNA.

source: Select Active IDNA Repertoire
fr: Selectionnez le répertoire IDNA actif

source: New IDNA Repertoire
fr: Nouveau répertoire IDNA

source: Add
fr: Ajouter

source: Existing MSRs
fr: MSRs existants

source: Are you sure you want to delete LGR %(lgr)s?
fr: Êtes vous sur de vouloir supprimer la LGR %(lgr)s ?

source: No MSR.
fr: Aucun MSR.

source: Select Active MSR
fr: Selectionnez le MSR actif

source: New MSR
fr: Nouveau MSR

source: Existing Reference LGRs
fr: LGRs de référence existantes

source: Files
fr: Fichiers

source: Edit Reference LGR member
fr: Modifier le membre de la LGR de référence

source: Display %(remain)s more files
fr: Afficher %(remain)s fichiers de plus

source: No Reference LGR.
fr: Aucune LGR de référence.

source: Select Active Reference LGR
fr: Selectionnez la LGR de référence active

source: New Reference LGR
fr: Nouvelle LGR de référence

source: Save
fr: Sauvegarder

source: Existing Root Zone LGRs
fr: LGRs existantes pour la Root Zone

source: No Root Zone LGR.
fr: Aucun LGR pour la Root Zone.

source: Select Active Root Zone LGR
fr: Selectionnez la LGR active pour la Root Zone

source: New Root Zone LGR
fr: Nouvelle LGR pour la Root Zone

source: Settings
fr: Paramètres

source: Index variant labels calculation
fr: Calcul de l'index des labels variants

source: Trigger the calculation of the index variant of the existing TLDs
fr: Lance le calcule de l'index sur les variants des TLDs existants

source: Refresh
fr: Rafrachir

source: Download
fr: Télécharger

source: Existing Users
fr: Utilisateurs existants

source: Enabled
fr: Activé

source: Role
fr: Rôle

source: Send password reset link
fr: Envoyer un mot de passe de réinitialisation

source: Edit
fr: Édition

source: Toggle Dropdown
fr: Active/Désactive le menu déroulant

source: Disable
fr: Désactiver

source: Enable
fr: Activer

source: Are you sure you want to delete user %(user)s?
fr: Êtes vous sur de vouloir supprimer l'utilisateur %(user)s ?

source: Delete
fr: Supprimer

source: Create a new user
fr: Créer un nouvel utilisateur

source: Edit user %(email)s
fr: Édition de l'utilisateur %(email)s

source: User is disabled
fr: L'utilisateur est désactivé

source: Back
fr: Précédent

source: Update
fr: Mise à jour

source: Are you sure you want to delete user %(object)s?
fr: Êtes vous certain de vouloir supprimer l'utilisateur %(object)s?

source: Error processing active indicator
fr: Error en traitant mettant à jour le choix actif

source: New IDNA Repertoire created
fr: Nouveau répertoire IDNA créé

source: Failed to create IDNA Repertoire
fr: Échec à la création du répertoire IDNA

source: New MSR created
fr: Nouveau MSR créé

source: Failed to create MSR
fr: Échec lors de la création du MSR

source: New Reference LGR created
fr: Nouvelle LGR de référence créée

source: Failed to create Reference LGR
fr: Échec à la création de la LGR de référence

source: Reference LGR member updated
fr: Le membre de la LGR de référence a été mis à jour

source: Failed to update Reference LGR member
fr: Échec à la mise à jour du membre de la LGR de référence

source: New RZ LGR created
fr: Nouvelle RZ LGR créée

source: Failed to create RZ LGR
fr: Échec à la création de la RZ LGR

source: The calculation of the index variant of the existing TLDs has been triggered
fr: Le calcul de l'index des variant sur les TLDs existant a été déclenché

source: The index variant calculation has already been triggered, please wait
fr: Le calcul des index de variants est déjà en cours, patientez s'il vous plait

source: Cannot create users when auth is performed with ICANN
fr: Impossible de créer des utilisateurs quand l'authentification est réalisée avec ICANN

source: New user created
fr: Nouvel utilisateur créé

source: Failed to create user
fr: Échec à la création de l'utilisateur
