Repository: icann/lgr-django
Catalog: src/lgr_tasks/locale/*/LC_MESSAGES/django.po
Languages: fr

source: LGR Process List
fr: Liste de processus LGR

source: Tasks
fr: Tâches

source: Tasks are ordered from newest to latest
fr: Les tâches sont ordonnées de la plus récente à la plus ancienne

source: Download report
fr: Télécharger le rapport

source: Success
fr: Réussi

source: In Progress
fr: En progrès

source: Failed
fr: Échec

source: Pending
fr: En attente

source: Retry
fr: Nouvel essai

source: Canceled
fr: Annulé

source: Expired
fr: Expiré

source: Are you sure you want to cancel this task?
fr: Êtes vous sur de vouloir supprimer cette tâche ?

source: The report
fr: Le rapport

source: When you delete a task, the corresponding report is not deleted
fr: Lorsque vous supprimez une tâche, le rapport correspondant n'est pas supprimé

source: Are you sure you want to clean tasks?
fr: Êtes vous sur de vouloir nettoyer les tâches?

source: Delete completed tasks
fr: Supprimer les tâches terminées

source: No task registered
fr: Aucune tâche enregistrée

source: Unable to retrieve the list of tasks.
fr: Impossible de retrouver la liste de tâches.

source: Failed to delete %s.
fr: Échec lors de la suppression de %s.

source: Task %s has been revoked.
fr: La tâche %s a été annulée.

source: Task %s has been removed.
fr: La tâche %s a été supprimée.

source: Failed to retrieve completed tasks.
fr: Échec lors de la récupération de la liste de tâches terminées.

source: Completed tasks have been cleaned.
fr: La liste de tâches terminées a été nettoyée.
