Repository: icann/lgr-django
Catalog: src/lgr_idn_table_review/icann_tools/locale/*/LC_MESSAGES/django.po
Languages: fr

source: ICANN IDN review tool
fr: Outil de vérification des tables IDN ICANN

source: IDN Table Report
fr: Rapport sur les tables IDN

source: IDNA 2008 non-compliance Report
fr: Rapport de non conformité IDNA 2008

source: Previously generated reports
fr: Rapport générés précédement

source: Are you sure you want to delete report %(report_id)s?
fr: Êtes vous sur de vouloir supprimer le rapport %(report_id)s ?

source: No report yet, please check the <a href="%(task_status_url)s">tasks</a> and refresh.
fr: Aucun rapport pour l'instant, vérifiez la liste de <a href="%(task_status_url)s">tâches</a> et rafraîchissez s'il vous plaît.

source: ICANN IDN Tables Review
fr: Outil de vérification des tables IDN ICANN

source: Generating report. You can follow your task progression in the %s.
fr: Rapport en création. Vous pouvez suivre la progression de votre tâche sur la %s.

source: ICANN IDN Tables IDNA 2008 compliance
fr: Outil de vérification de la conformité IDNA 2008 des tables IDN ICANN

source: Task is still being processed, please come back later for the full report.
fr: La tâche est encore en cours, revenez plus tard pour un rapport complet s'il vous plait.

source: ICANN Review Reports: %(report)s
fr: Rapport de Vérification ICANN: %(report)s
