Repository: icann/lgr-django
Catalog: src/lgr_tools/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Diff
fr: Différence

source: First LGR
fr: Première LGR

source: First LGR to use in tool
fr: Première LGR à utiliser dans l'outil

source: Second LGR
fr: Seconde LGR

source: Second LGR to use in tool
fr: Seconde LGR à utiliser dans l'outil

source: Action to perform on LGRs
fr: Action à effectuer sur les LGR

source: Choose the action to perform on selected LGRs
fr: Choisir l'action à exécuter sur les LGR

source: Full dump
fr: Résumé complet

source: Print a full dump (i.e. with identical code points as well)
fr: Afficher la sortie complète (incluant les code points identiques)

source: LGR set
fr: Set LGR

source: List of labels to use in tool. File must be encoded in UTF-8 and using UNIX line ending.
fr: Liste de labels à utiliser dans l'outil. Le fichier doit être encodé en UTF-8, et utiliser des retours à la ligne UNIX.

source: Provide your e-mail address
fr: Fournir une adresse e-mail

source: Check collisions
fr: Rechercher les collisions

source: Also check for collision of labels in both LGR
fr: Vérifier aussi les collisions sur les labels dans les deux LGR

source: Print a full dump
fr: Afficher un résumé complet

source: Output rules
fr: Afficher les règles

source: Show rules in output (this can be very verbose)
fr: Affiche les règles dans le fichier de sortie (cela peut être très verbeux)

source: LGR to use in tool
fr: LGR à utiliser dans l'outil

source: Also check for collision with existing TLDs
fr: Vérifier aussi les collisions avec les TLDs existants

source: The script used to validate the label
fr: Script utilisé pour valider le label

source: Allocated Set labels
fr: Labels du set alloués

source: Optional list of labels already allocated in the LGR set, that will be used to check for collisions when evaluating labels using the merged LGR set. File must be encoded in UTF-8 and using UNIX line ending.
fr: Liste optionnelle de labels déjà alloués dans le set LGR, qui seront utilisés pour vérifier les collisions lors de l'évaluation de labels en utilisant le set LGR fusionné. Le fichier doit être encodé en UTF-8, et utiliser des retours à la ligne UNIX.

source: Root Zone LGR
fr: LGR de la Root Zone

source: The (optional) RootZone LGR to infer new variant sets from
fr: La LGR Root Zone optionnelle pour inférer de nouvelles variantes

source: Cannot decode input file. Make sure it is encoded in UTF-8
fr: Impossible de décoder le fichier d'entrée. Veuillez vous assurer qu'il est encodé en UTF-8

source: As the computing may be very long, we will warn by e-mail once the result can be downloaded. Please provide a valid e-mail address:
fr: Le temps de calcul peut être très long, vous serez averti par e-mail lorsque le résultat pourra être téléchargé. Fournissez une adresse e-mail valide s'il vous plaît :

source: Annotate
fr: Annoter

source: Get collisions
fr: Calculer les collisions

source: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> Note that collision tool is not available for LGR sets.</strong>
fr: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> L'outil de collisions n'est pas disponible pour les sets LGR.</strong>

source: Result of diff of <a href="%(lgr_1_url)s">%(lgr_1_name)s</a> with <a href="%(lgr_2_url)s">%(lgr_2_name)s</a>
fr: Resultat du diff de <a href="%(lgr_1_url)s">%(lgr_1_name)s</a> avec <a href="%(lgr_2_url)s">%(lgr_2_name)s</a>

source: The %(comp_type)s of <a href="%(lgr_1_url)s">%(lgr_1_name)s</a> with <a href="%(lgr_2_url)s">%(lgr_2_name)s</a> need editing to be valid.
fr: L'%(comp_type)s de <a href="%(lgr_1_url)s">%(lgr_1_name)s</a> avec <a href="%(lgr_2_url)s">%(lgr_2_name)s</a> nécessite d'être éditée pour être valide.

source: Please download and edit it manually before importing it in LGR Toolset.
fr: Merci de télécharger et éditer la LGR manuellement avant de l'importer dans l'éditeur.

source: To help, here is the error log from the validation:
fr: Pour aider, voici les messages d'erreurs de la validation :

source: Download invalid LGR %(comp_type)s file
fr: Télécharger l'%(comp_type)s de LGR invalide

source: Download
fr: Télécharger

source: Compare
fr: Comparer

source: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> Note that comparison will be performed only between two LGR sets or two simple LGRs, union and intersection are not available for LGR sets.</strong>
fr: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> La comparaison sera uniquement applicable entre deux set LGR ou deux LGR simples, l'union et la comparaison ne sont pas disponibles pour les set LGR.</strong>

source: Launch
fr: Démarrer

source: Get diff
fr: Calculer les différences

source: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> Note that diff tool is not available for LGR sets.</strong>
fr: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> L'outil de différence n'est pas disponible pour les sets LGR.</strong>

source: Results of harmonization for %(lgr_1_name)s and %(lgr_2_name)s
fr: Résultat de l'harmonisation de %(lgr_1_name)s et %(lgr_2_name)s

source: Resulting LGRs
fr: LGR résultantes

source: View harmonized version of %(name)s
fr: Voir la version harmonisée de %(name)s

source: Harmonize
fr: Harmoniser

source: Compute variants
fr: Calcul des variantes

source: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> Note that variants tool is not available for LGR sets.</strong>
fr: <strong class="text-danger"><i class="glyphicon glyphicon-alert"></i> L'outil de calcul de variantes n'est pas disponible pour les sets LGR.</strong>

source: Computing annotations on labels provided in file %(labels_file)s in LGR <a href="%(lgr_url)s">%(lgr_name)s</a>
fr: Annotation des labels fournis dans le fichier %(labels_file)s avec la LGR <a href="%(lgr_url)s">%(lgr_name)s</a>

source: with script from <a href="%(lgr_script_url)s">%(script)s</a>
fr: avec le script <a href="%(lgr_script_url)s">%(script)s</a>

source: As the computing may be very long, once completed, an e-mail will be sent at the provided address: %(email)s
fr: Le temps de calcul peut être très long, une fois terminé, un e-mail vous sera envoyé à l'adresse suivante : %(email)s

source: Computing collisions on labels provided in file %(labels_file)s in LGR <a href="%(lgr_url)s">%(lgr_name)s</a>
fr: Calcul des collisions sur les labels fournis dans le fichier %(labels_file)s dans la LGR <a href="%(lgr_url)s">%(lgr_name)s</a>

source: and also check with <a href="%(icann_tlds)s">ICANN TLDs</a>
fr: et avec les <a href="%(icann_tlds)s">TLDs ICANN</a>

source: Computing cross-script variants on labels provided in file %(labels_file)s in LGR <a href="%(lgr_url)s">%(lgr_name)s</a>
fr: Calcul des variantes cross-scripts sur les labels fournis dans le fichier %(labels_file)s avec la LGR <a href="%(lgr_url)s">%(lgr_name)s</a>

source: Computing diff on labels provided in file %(labels_file)s between <a href="%(lgr_1_url)s">%(lgr_1_name)s</a> and <a href="%(lgr_2_url)s">%(lgr_2_name)s</a>
fr: Calcul des différences sur les labels fournis dans le fichier %(labels_file)s entre les LGR <a href="%(lgr_1_url)s">%(lgr_1_name)s</a> et <a href="%(lgr_2_url)s">%(lgr_2_name)s</a>

source: Computing variants of labels provided in file %(labels_file)s in LGR <a href="%(lgr_url)s">%(lgr_name)s</a>
fr: Calcul des variantes pour les labels fournis dans le fichier %(labels_file)s avec la LGR <a href="%(lgr_url)s">%(lgr_name)s</a>
