Repository: icann/lgr-django
Catalog: src/lgr_basic/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Required
fr: Requis

source: Unknown error, please report
fr: Erreur inconnue, reportez l'erreur s'il vous plait

source: LGR Label Validation Tool
fr: Outil LGR pour la Validation de Label

source: Label Validation Tool
fr: Outil de validation de Label

source: The server was unable to complete the request, most likely because too many resources were required to compute the query. If you check for collision, the result may be still processing. Please wait before submitting again.
fr: Le serveur n'a pas pu compléter la requête, probablement parce que trop de ressources sont nécessaires pour calculer la requête. Si vous vérifiez une collision, le résultat pourrait toujours être en cours de traitement. Merci de patienter avant de soumettre à nouveau.

source: A server error occurred.
fr: Une erreur de serveur s'est produite.

source: Please contact the administrator before submitting again.
fr: Veuillez contacter l'administrateur avant de soumettre votre requête à nouveau.

source: Validate label(s) against
fr: Valider le(s) label(s) avec

source: View LGR as
fr: Voir la LGR en

source: Manually input label(s)
fr: Entrer le(s) label(s) manuellement

source: Upload a list of labels
fr: Télécharger une liste de labels

source: Check for collision with existing TLDs
fr: Vérifier les collisions avec la liste de TLDs

source: Include mixed script variants
fr: Inclure les variants issus de scripts différents

source: Your request was sent successfully, the collision and validation tasks processing can take minutes, even hours.<br> You can follow your task progression on the <a href="%(task_status_url)s">task status page</a>.
fr: Votre requête a bien été envoyée, le calcul des collision et la tâche de validation peuvent prendre plusieurs minutes, voire plusieurs heures.<br> Vous pouvez suivre la progression de votre tâche sur la <a href="%(task_status_url)s">page des statuts de tâches</a>.

source: Your request was sent successfully, the validation task processing can take minutes, even hours.<br> You can follow your task progression on the <a href="%(task_status_url)s">task status page</a>.
fr: Votre requête a bien été envoyée, la tâche de validation peut prendre plusieurs minutes, voire plusieurs heures.<br> Vous pouvez suivre la progression de votre tâche sur la <a href="%(task_status_url)s">page des statuts de tâches</a>.

source: Your request was sent successfully, the collision task processing can take minutes, even hours.<br> You can follow your task progression on the <a href="%(task_status_url)s">task status page</a>.
fr: Votre requête a bien été envoyée, le calcul des collisions peut prendre plusieurs minutes, voire plusieurs heures.<br> Vous pouvez suivre la progression de votre tâche sur la <a href="%(task_status_url)s">page des statuts de tâches</a>.

source: Validate
fr: Valider

source: IDN validation while converting to A-Label failed:
fr: Échec de la validation IDN lors de la conversion en A-Label:

source: Your saved results
fr: Vos résultats sauvegardés

source: The following files contains your tools computation results.
fr: Ces fichiers contiennent les résultats des calculs fournis par les outils.

source: Annotate labels on LGR %s
fr: Annote les labels sur la LGR %s

source: Compute collisions and annotate labels on %s
fr: Calcul des collisions et annotation des labels sur %s

source: Compute collisions on %s
fr: Calcul des collisions sur %s

source: Input label generates too many variants to compute them all quickly. You can follow your task progression on the %s.
fr: Le label entré génère trop de variantes pour les calculer toutes rapidement. Vous pouvez suivre la progression de votre tâche sur la %s.
