Repository: icann/lgr-django
Catalog: src/lgr_auth/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Email is mandatory
fr: Le champ e-mail est obligatoire

source: Required. Valid email address
fr: Requis. Entrez une adresse e-mail valide

source: An user with that email already exists.
fr: Un utilisateur avec cet e-mail existe déjà.

source: first name
fr: prénom

source: last name
fr: nom

source: active
fr: actif

source: date joined
fr: date d'inscription

source: user
fr: utilisateur

source: users
fr: utilisateurs

source: LGR Tools login
fr: Connexion aux Outils LGRs

source: Login
fr: Connexion

source: Your username and password didn't match. Please try again.
fr: Votre utilisateur et mot de passe ne correspondent pas. Re-essayez s'il vous plaît.

source: Your account doesn't have access to this page. To proceed, please login with an account that has access.
fr: Vous n'avez pas accès à cette page. Pour y accéder, veuillez vous connecter avec un compte qui y a accès.

source: Please login to see this page.
fr: Connectez vous pour voir cette page s'il vous plaît.

source: LGR Tools password reset
fr: Réinitialiser le mot de passe pour les Outils LGR

source: Reset password
fr: Réinitialiser le mot de passe

source: Your password has been set. You may go ahead and log in now.
fr: Votre mot de passe a été sauvegardé. Vous pouvez maintenant vous connecter.

source: Log in
fr: Connexion

source: Save
fr: Sauvegarder

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
fr: Le lien de réinitialisation du mot de passe est invalide, il est possible qu'il ait déjà été utilisé. Veuillez redemander une nouvelle réinitialisation de mot de passe s'il vous plaît.

source: A link has been sent to your email address.
fr: Un lien a été envoyé à votre adresse e-mail.

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
fr: Vous recevez cet e-mail car vous avez demandé une réinitialisation de mot de passe pour votre compte sur %(site_name)s.

source: Please go to the following page and choose a new password:
fr: Veuillez aller sur la page suivante et choisissez un mot de passe:

source: Your username, in case you’ve forgotten:
fr: Votre nom d'utilisateur, au cas où vous l'auriez oublié:

source: Thanks for using our site!
fr: Merci d'utiliser notre site!

source: The %(site_name)s team
fr: L'équipe %(site_name)s

source: Reset
fr: Réinitialiser

source: Password reset on LGR Toolset
fr: Réinitialisation de mot de passe pour les Outils LGR

source: LGR Tools ICANN operation failure
fr: Outils LGR: échec de l'opération avec ICANN

source: ICANN operation failure
fr: Échec de l'opération avec ICANN

source: Failed to process response from ICANN, please contact administrator
fr: Échec du traitement de la réponse de ICANN, contactez votre administrateur s'il vous plaît

source: LGR Tools user edition
fr: Edition d'utilisateur des Outils LGR

source: Edit user %(email)s
fr: Édition de l'utilisateur %(email)s

source: Update
fr: Mise à jour

source: Edit ICANN profile
fr: Édition du profile ICANN

source: User updated
fr: Utilisateur mis à jour

source: Failed to update user
fr: Échec de la mise à jour de l'utilisateur

source: User is not logged with ICANN
fr: L'utilisateur n'est pas enregistré avec ICANN
